ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f398xx.h
/******************  Bit definition for FMC_PATTx register  ******************/
#define FMC_PATTx_ATTSETx_Pos       (0U)                                       
#define FMC_PATTx_ATTSETx_Msk       (0xFFU << FMC_PATTx_ATTSETx_Pos)           /*!< 0x000000FF */
#define FMC_PATTx_ATTSETx           FMC_PATTx_ATTSETx_Msk                      /*!<ATTSETx[7:0] bits (Attribute memory x setup time) */
#define FMC_PATTx_ATTSETx_0         (0x01U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000001 */
#define FMC_PATTx_ATTSETx_1         (0x02U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000002 */
#define FMC_PATTx_ATTSETx_2         (0x04U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000004 */
#define FMC_PATTx_ATTSETx_3         (0x08U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000008 */
#define FMC_PATTx_ATTSETx_4         (0x10U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000010 */
#define FMC_PATTx_ATTSETx_5         (0x20U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000020 */
#define FMC_PATTx_ATTSETx_6         (0x40U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000040 */
#define FMC_PATTx_ATTSETx_7         (0x80U << FMC_PATTx_ATTSETx_Pos)           /*!< 0x00000080 */

#define FMC_PATTx_ATTWAITx_Pos      (8U)                                       
#define FMC_PATTx_ATTWAITx_Msk      (0xFFU << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x0000FF00 */
#define FMC_PATTx_ATTWAITx          FMC_PATTx_ATTWAITx_Msk                     /*!<ATTWAITx[7:0] bits (Attribute memory x wait time) */
#define FMC_PATTx_ATTWAITx_0        (0x01U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00000100 */
#define FMC_PATTx_ATTWAITx_1        (0x02U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00000200 */
#define FMC_PATTx_ATTWAITx_2        (0x04U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00000400 */
#define FMC_PATTx_ATTWAITx_3        (0x08U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00000800 */
#define FMC_PATTx_ATTWAITx_4        (0x10U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00001000 */
#define FMC_PATTx_ATTWAITx_5        (0x20U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00002000 */
#define FMC_PATTx_ATTWAITx_6        (0x40U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00004000 */
#define FMC_PATTx_ATTWAITx_7        (0x80U << FMC_PATTx_ATTWAITx_Pos)          /*!< 0x00008000 */

#define FMC_PATTx_ATTHOLDx_Pos      (16U)                                      
#define FMC_PATTx_ATTHOLDx_Msk      (0xFFU << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00FF0000 */
#define FMC_PATTx_ATTHOLDx          FMC_PATTx_ATTHOLDx_Msk                     /*!<ATTHOLDx[7:0] bits (Attribute memory x hold time) */
#define FMC_PATTx_ATTHOLDx_0        (0x01U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00010000 */
#define FMC_PATTx_ATTHOLDx_1        (0x02U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00020000 */
#define FMC_PATTx_ATTHOLDx_2        (0x04U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00040000 */
#define FMC_PATTx_ATTHOLDx_3        (0x08U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00080000 */
#define FMC_PATTx_ATTHOLDx_4        (0x10U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00100000 */
#define FMC_PATTx_ATTHOLDx_5        (0x20U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00200000 */
#define FMC_PATTx_ATTHOLDx_6        (0x40U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00400000 */
#define FMC_PATTx_ATTHOLDx_7        (0x80U << FMC_PATTx_ATTHOLDx_Pos)          /*!< 0x00800000 */

#define FMC_PATTx_ATTHIZx_Pos       (24U)                                      
#define FMC_PATTx_ATTHIZx_Msk       (0xFFU << FMC_PATTx_ATTHIZx_Pos)           /*!< 0xFF000000 */
#define FMC_PATTx_ATTHIZx           FMC_PATTx_ATTHIZx_Msk                      /*!<ATTHIZx[7:0] bits (Attribute memory x databus HiZ time) */
#define FMC_PATTx_ATTHIZx_0         (0x01U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x01000000 */
#define FMC_PATTx_ATTHIZx_1         (0x02U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x02000000 */
#define FMC_PATTx_ATTHIZx_2         (0x04U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x04000000 */
#define FMC_PATTx_ATTHIZx_3         (0x08U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x08000000 */
#define FMC_PATTx_ATTHIZx_4         (0x10U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x10000000 */
#define FMC_PATTx_ATTHIZx_5         (0x20U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x20000000 */
#define FMC_PATTx_ATTHIZx_6         (0x40U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x40000000 */
#define FMC_PATTx_ATTHIZx_7         (0x80U << FMC_PATTx_ATTHIZx_Pos)           /*!< 0x80000000 */

/******************  Bit definition for FMC_PATT2 register  ******************/
#define FMC_PATT2_ATTSET2_Pos       (0U)                                       
#define FMC_PATT2_ATTSET2_Msk       (0xFFU << FMC_PATT2_ATTSET2_Pos)           /*!< 0x000000FF */
#define FMC_PATT2_ATTSET2           FMC_PATT2_ATTSET2_Msk                      /*!<ATTSET2[7:0] bits (Attribute memory 2 setup time) */
#define FMC_PATT2_ATTSET2_0         (0x01U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000001 */
#define FMC_PATT2_ATTSET2_1         (0x02U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000002 */
#define FMC_PATT2_ATTSET2_2         (0x04U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000004 */
#define FMC_PATT2_ATTSET2_3         (0x08U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000008 */
#define FMC_PATT2_ATTSET2_4         (0x10U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000010 */
#define FMC_PATT2_ATTSET2_5         (0x20U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000020 */
#define FMC_PATT2_ATTSET2_6         (0x40U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000040 */
#define FMC_PATT2_ATTSET2_7         (0x80U << FMC_PATT2_ATTSET2_Pos)           /*!< 0x00000080 */

#define FMC_PATT2_ATTWAIT2_Pos      (8U)                                       
#define FMC_PATT2_ATTWAIT2_Msk      (0xFFU << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x0000FF00 */
#define FMC_PATT2_ATTWAIT2          FMC_PATT2_ATTWAIT2_Msk                     /*!<ATTWAIT2[7:0] bits (Attribute memory 2 wait time) */
#define FMC_PATT2_ATTWAIT2_0        (0x01U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00000100 */
#define FMC_PATT2_ATTWAIT2_1        (0x02U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00000200 */
#define FMC_PATT2_ATTWAIT2_2        (0x04U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00000400 */
#define FMC_PATT2_ATTWAIT2_3        (0x08U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00000800 */
#define FMC_PATT2_ATTWAIT2_4        (0x10U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00001000 */
#define FMC_PATT2_ATTWAIT2_5        (0x20U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00002000 */
#define FMC_PATT2_ATTWAIT2_6        (0x40U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00004000 */
#define FMC_PATT2_ATTWAIT2_7        (0x80U << FMC_PATT2_ATTWAIT2_Pos)          /*!< 0x00008000 */

